// Створення об'єкта myObject з трьома початковими властивостями
let myObject = {
    name: 'Сергій',
    age: 27,
    city: 'Одеса',

    // Метод getInfo виводить всі властивості об'єкта у вигляді пар "ключ: значення".
    getInfo: function () {
        // Цикл for...in проходиться по всіх властивостях об'єкта.
        for (let key in this) {
            // Перевірка, чи властивість не є методом (функцією).
            if (typeof this[key] !== 'function') {
                // Вивід пари "ключ: значення" для кожної властивості.
                console.log(`<${key}>: ${this[key]}`);
            }
        }
    }
};

// Вивід початкової інформації про об'єкт за допомогою методу getInfo.
console.log("Початкова інформація про об'єкт:");
myObject.getInfo();

// Зміна властивостей та додавання нових.
myObject.name = 'Олександр';
myObject.city = 'Київ';
myObject.age = 25;

// Додаю нові властивості.
myObject.gender = 'чоловіча';
myObject.job = 'програміст';
myObject.hobbies = ['плавання', 'музика'];

// Вивід інформації про об'єкт після змін та додавання нових властивостей.
console.log("\nІнформація про об'єкт після змін та додавання нових властивостей:");
myObject.getInfo();

