// Оголошення функції pow, яка приймає два аргументи: основу (x) та показник ступеня (y).
function pow(x, y) {
    // Ініціалізуємо змінну для збереження результату підняття до ступеня.
    let result = 1;

    // Використовуємо цикл для обчислення підняття до ступеня, y разів.
    for (let i = 0; i < y; i++) {
        // Перемножуємо поточний результат на основу (x).
        result *= x;
    }

    // Повертаємо отриманий результат підняття до ступеня.
    return result;
}

// Приклад використання функції pow з аргументами 2 та 3.
let result = pow(2, 3);

// Виводимо результат у консоль.
console.log(result); // Очікуваний результат: 8
