/** Програма працює в браузері. IDE видавав помилку, але інтернет підказав в консолі браузера спробувати)
 не знаю чи то помилка. */
// Роблю запит на введення одиниці вимірювання (км, год або кг).
let unit = prompt("Введіть одиницю вимірювання (км, год або кг)");
// Запит на кількість та конвертація введеного значення в число.
let quantity = +prompt("Введіть кількість");
// Роблю перевірку, чи введена кількість є числом.
if (!isNaN(quantity)) {
    // За допомогою switch виконується конвертація та вивід результату.
    switch (unit) {
        case "км":
            // Спочатку роблю конвертацію кількості кілометрів в метри.
            let meters = quantity * 1000;
            // Тепер вивід результату в метрах.
            alert(`${quantity} км це ${meters} м.`);
            break;
        case "год":
            // Теж саме з конвертацією годин в хвилини.
            let minutes = quantity * 60;
            // Результату в хв.
            alert(`${quantity} год це ${minutes} хв.`);
            break;
        case "кг":
            // Повторюю для кількості кілограмів в грами.
            let grams = quantity * 1000;
            // Результат в г.
            alert(`${quantity} кг це ${grams} г.`);
            break;
        default:
            // Роблю попередєення якщо, введена одиниця виміру невідома.
            alert("Невідома одиниця виміру");
    }
} else {
    // Такеж попередження, якщо введена кількість не є числом.
    alert("Будь ласка, введіть числове значення.");
}
