/** Програма працює в браузері. IDE видавав помилку, але інтернет підказав в консолі браузера спробувати)
 не знаю чи то помилка. */
// Спочатку отримую від користувача рік.
let yearInput = prompt("Введіть кількість років");
// Конвертую введене значення в число за допомогою унарного плюса.
let year = +yearInput;
// Перевіряю, чи введене значення є числом і воно не від'ємне та не більше 100.
if (!isNaN(year) && year >= 0 && year <= 100) {
    // Визначаю, яке слово використовувати для виведення в залежності від числа років.
    let word;

    // Використовую "років" для чисел, які закінчуються на 11, 12, 13, 14, або від 5 до 20.
    if ((year % 100 >= 11 && year % 100 <= 14) || (year % 10 >= 5 && year % 10 <= 9) || year % 10 === 0) {
        word = "років";
    }
    // Використовую "рік" для чисел, які закінчуються на 1.
    else if (year % 10 === 1) {
        word = "рік";
    }
    // Використовую "роки" для чисел, які закінчуються на 2, 3, або 4.
    else if (year % 10 >= 2 && year % 10 <= 4) {
        word = "роки";
    }

    // Показую результат.
    alert(`Ваш вік: ${year} ${word}`);
} else {
    // Роблю попередження, якщо є помилка в вводі даних.
    alert("Введіть додатнє число до 100 років.");
}

